Autodesk.Revit.DB.Analysis.GenericZone.GetBoundaries
Gets the boundaries for the generic zone.
Returns:
The generic zone boundaries.
Since:
2020

Autodesk.Revit.DB.Analysis.GenericZone.GetDomainData
Gets the domain data for the generic zone.
Returns:
Returns a pointer to the base class for specific domain requirements for the generic zone.
Since:
2020

Autodesk.Revit.DB.Analysis.GenericZone.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.GenericZoneDomainData,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a new instance of a generic zone and adds it to the document.
doc:
The document where the element will be created and added.
name:
The name of the generic zone to be created.
domainData:
The specific domain requirements for the generic zone.
levelId:
The base level on which the generic zone will be created.
curveLoops:
The loops that define the lines, curves and areas that overlap or crosses the elements you want to belong to the zone.
Multiple loops are allowed, they can be open or closed, but they should be on the same horizontal plane.
Returns:
The newly created generic zone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
-or-
name is an empty string.
-or-
The ElementId levelId is not a Level.
-or-
The input curve loops do not all lie in the same horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.GenericZone
Provides access to the GenericZone Element in Autodesk Revit.
Remarks:
A generic zone is a tool that provides for a method of selecting elements that somehow come in contact with the zone object.
A zone is a non-hierarchical structure of geometric information, area or volume definitions for the purpose of analysis.
A generic zone will contain specific domain requirements provided at creation of the element.
Since:
2020